
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЕстьПрава = Истина;
	Если НЕ ПравоДоступа("Администрирование", Метаданные) Тогда
		Сообщить("Отсутствуют административные права!", СтатусСообщения.Важное);
		ЕстьПрава = Ложь;
	КонецЕсли;
	Если НЕ ПравоДоступа("ЖурналРегистрации", Метаданные) Тогда
		Сообщить("Недостаточно прав для работы с журналом регистрации!", СтатусСообщения.Важное);
		ЕстьПрава = Ложь;
	КонецЕсли;
	Если НЕ ЕстьПрава Тогда 
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
		
КонецПроцедуры

// Настройки отчета

&НаСервере
Процедура УстановитьНачальныеНастройки()
	
	ОтчетОбъект = РеквизитФормыВЗначение("Отчет");
	
	Настройки = ОтчетОбъект.КомпоновщикНастроек.Настройки;
	
	ПараметрПользователь = Настройки.ПараметрыДанных.Элементы.Найти("Пользователь");
	ПользователиИнфБазы = ПользователиИнформационнойБазы.ПолучитьПользователей();
	СписокПользователейИБ = Новый СписокЗначений;
	Для Каждого Пользователь Из ПользователиИнфБазы Цикл
		СписокПользователейИБ.Добавить(Пользователь.Имя);
	КонецЦикла;                                  
	ПараметрПользователь.Значение = СписокПользователейИБ;
	
	ПараметрИмяПриложения = Настройки.ПараметрыДанных.Элементы.Найти("ИмяПриложения");
	СписокИменПриложений = Новый СписокЗначений;
	СписокИменПриложений.Добавить("1CV8");
	СписокИменПриложений.Добавить("1CV8C");
	СписокИменПриложений.Добавить("WebClient");
	СписокИменПриложений.Добавить("Designer");
	СписокИменПриложений.Добавить("COMConnection");
	СписокИменПриложений.Добавить("WSConnection");
	СписокИменПриложений.Добавить("BackgroundJob");
	СписокИменПриложений.Добавить("SrvrConsole");
	СписокИменПриложений.Добавить("COMConsole");
	СписокИменПриложений.Добавить("JobScheduler");
	СписокИменПриложений.Добавить("Debugger");
	ПараметрИмяПриложения.Значение = СписокИменПриложений;

	ЗначениеВРеквизитФормы(ОтчетОбъект, "Отчет");
	
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьНачальныеНастройки();
	
КонецПроцедуры


&НаКлиенте
Процедура БлогНажатие(Элемент)
	
	ЗапуститьПриложение("http://www.develplatform.com/");
	
КонецПроцедуры

